#========================================================================================
#============================ root makefile =============================================
#========================================================================================
# @autor: Максимов Денис Николаевич
# @mail: dn.maksimow@gmail.com
#----------------------------------------------------------------------------------------
#    Это скрипт для компиляции Си и Си++ файлов и GUI на FLTK 
# в рамках проекта Weight Convejor
#========================================================================================




#--- Скрыть лишний вывод в терминал ---
.SILENT:

#========================================================================================
#========================================================================================
#========================================================================================
all:
		# make -f Makefile.linux clean
		echo "windows compile"
		make -f Makefile.windows

		make -f Makefile.windows clean
		echo "linux compile"
		make -f Makefile.linux

		echo "##################### Windows ######################"
		size ./relise/hello.exe ;echo "";
		echo "###################### Linux  ######################"
		size ./relise/run
Windows: 
		echo "windows compile"
		make -f Makefile.windows
Linux:
		echo "linux compile"
		make -f Makefile.linux


#-----------------------------------------
#-- Правило для очистки рабочей области --
#-----------------------------------------
clean:
	make -f Makefile.windows clean

